1. Getting the data

2. Importing Libararies

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

3. Importing a Dataset

In [34]:
df = pd.read_csv("Data.csv")

Extracting Dependent and Independent Variables

In [40]:
x = df.iloc[:,:-1] #gives independent variables
y = df.iloc[:,3] #gives dependent variable

4. Handling missing data

In [24]:
from sklearn.impute import SimpleImputer

In [38]:
# x.iloc[:,1:]
imputer = SimpleImputer(strategy = 'mean')
out = imputer.fit_transform(df[["Age", "Salary"]])

In [39]:
df['Age'] = out[:,0]
df['Salary'] = out[:,1]

In [41]:
x

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

5. Encoding Categorical data

In [31]:
from sklearn.preprocessing import LabelEncoder

In [36]:
lblenc = LabelEncoder()
df['Purchased'] = lblenc.fit_transform(df['Purchased'])

In [37]:
df

   Country   Age   Salary  Purchased
0   France  44.0  72000.0          0
1    Spain  27.0  48000.0          1
2  Germany  30.0  54000.0          0
3    Spain  38.0  61000.0          0
4  Germany  40.0      NaN          1
5   France  35.0  58000.0          1
6    Spain   NaN  52000.0          0
7   France  48.0  79000.0          1
8  Germany  50.0  83000.0          0
9   France  37.0  67000.0          1